tiborsimon/embedded-tdd-headers/pic/8bit/pic18f95j94_tdd.h
#define CCP4Y                         2207
#define DC4B0                         2208
#define DC4B                          2209
#define CCP4X                         2210
#define DC4B1                         2211
#define CCPR4L                        2212
#define CCPR4H                        2213
#define T5GCON                        2214
#define T5GSS                         2215
#define T5GSS0                        2216
#define T5GSS1                        2217
#define T5GVAL                        2218
#define T5GGO_NOT_T5DONE              2219
#define nT5DONE                       2220
#define T5GGO_nT5DONE                 2221
#define NOT_T5DONE                    2222
#define T5GGO                         2223
#define T5GSPM                        2224
#define T5GTM                         2225
#define T5GPOL                        2226
#define TMR5GE                        2227
#define T5CON                         2228
#define TMR5ON                        2229
#define T5CON_RD16                    2230
#define RD165                         2231
#define nT5SYNC                       2232
#define NOT_T5SYNC                    2233
#define SOSCEN5                       2234
#define T5CON_SOSCEN                  2235
#define T5CON_TCKPS                   2236
#define T5CKPS0                       2237
#define T5CKPS1                       2238
#define TMR5CS0                       2239
#define TMR5CS                        2240
#define TMR5CS1                       2241
#define TMR5L                         2242
#define TMR5H                         2243
#define SSP2MSK                       2244
#define SSP2MSK_SSPMSK                2245
#define SSP2MSK_MSK0                  2246
#define SSP2MSK_MSK1                  2247
#define SSP2MSK_MSK2                  2248
#define SSP2MSK_MSK3                  2249
#define SSP2MSK_MSK4                  2250
#define SSP2MSK_MSK5                  2251
#define SSP2MSK_MSK6                  2252
#define SSP2MSK_MSK7                  2253
#define SSP2CON2                      2254
#define SEN2                          2255
#define SSP2CON2_SEN                  2256
#define ADMSK12                       2257
#define SSP2CON2_RSEN                 2258
#define SSP2CON2_ADMSK                2259
#define RSEN2                         2260
#define SSP2CON2_ADMSK1               2261
#define ADMSK22                       2262
#define PEN2                          2263
#define SSP2CON2_PEN                  2264
#define SSP2CON2_ADMSK2               2265
#define ADMSK32                       2266
#define SSP2CON2_RCEN                 2267
#define RCEN2                         2268
#define SSP2CON2_ADMSK3               2269
#define ACKEN2                        2270
#define ADMSK42                       2271
#define SSP2CON2_ADMSK4               2272
#define SSP2CON2_ACKEN                2273
#define ACKDT2                        2274
#define ADMSK52                       2275
#define SSP2CON2_ACKDT                2276
#define SSP2CON2_ADMSK5               2277
#define SSP2CON2_ACKSTAT              2278
#define ACKSTAT2                      2279
#define GCEN2                         2280
#define SSP2CON2_GCEN                 2281
#define SSP2CON1                      2282
#define SSP2CON1_SSPM                 2283
#define SSP2CON1_SSPM0                2284
#define SSPM02                        2285
#define SSPM12                        2286
#define SSP2CON1_SSPM1                2287
#define SSP2CON1_SSPM2                2288
#define SSPM22                        2289
#define SSPM32                        2290
#define SSP2CON1_SSPM3                2291
#define SSP2CON1_CKP                  2292
#define CKP2                          2293
#define SSPEN2                        2294
#define SSP2CON1_SSPEN                2295
#define SSPOV2                        2296
#define SSP2CON1_SSPOV                2297
#define WCOL2                         2298
#define SSP2CON1_WCOL                 2299
#define SSP2STAT                      2300
#define SSP2STAT_BF                   2301
#define BF2                           2302
#define SSP2STAT_UA                   2303
#define UA2                           2304
#define SSP2STAT_R_W                  2305
#define RW2                           2306
#define SSP2STAT_nWRITE               2307
#define SSP2STAT_nW                   2308
#define READ_WRITE2                   2309
#define nW2                           2310
#define SSP2STAT_I2C_READ             2311
#define I2C_READ2                     2312
#define SSP2STAT_R_NOT_W              2313
#define R_nW2                         2314
#define SSP2STAT_READ_WRITE           2315
#define nWRITE2                       2316
#define R_W2                          2317
#define SSP2STAT_R_nW                 2318
#define SSP2STAT_NOT_WRITE            2319
#define SSP2STAT_S                    2320
#define S2                            2321
#define START2                        2322
#define SSP2STAT_I2C_START            2323
#define I2C_START2                    2324
#define P2                            2325
#define SSP2STAT_I2C_STOP             2326
#define STOP2                         2327
#define SSP2STAT_P                    2328
#define I2C_STOP2                     2329
#define I2C_DAT2                      2330
#define DATA_ADDRESS2                 2331
#define SSP2STAT_D_NOT_A              2332
#define SSP2STAT_I2C_DAT              2333
#define D_A2                          2334
#define SSP2STAT_NOT_ADDRESS          2335
#define SSP2STAT_D_nA                 2336
#define SSP2STAT_DATA_ADDRESS         2337
#define SSP2STAT_nADDRESS             2338
#define nA2                           2339
#define DA2                           2340
#define nADDRESS2                     2341
#define SSP2STAT_nA                   2342
#define SSP2STAT_D_A                  2343
#define D_nA2                         2344
#define SSP2STAT_CKE                  2345
#define CKE2                          2346
#define SSP2STAT_SMP                  2347
#define SMP2                          2348
#define PSTR3CON                      2349
#define PSTR3CON_STRA                 2350
#define STRA3                         2351
#define STRB3                         2352
#define PSTR3CON_STRB                 2353
#define PSTR3CON_STRC                 2354
#define STRC3                         2355
#define STRD3                         2356
#define PSTR3CON_STRD                 2357
#define STRSYNC3                      2358
#define PSTR3CON_STRSYNC              2359
#define PSTR3CON_CMPL0                2360
#define CMPL03                        2361
#define PSTR3CON_CMPL                 2362
#define CMPL13                        2363
#define PSTR3CON_CMPL1                2364
#define PSTR2CON                      2365
#define PSTR2CON_STRA                 2366
#define P2DC02                        2367
#define STRA2                         2368
#define P2DC0CON                      2369
#define STRB2                         2370
#define P2DC12                        2371
#define PSTR2CON_STRB                 2372
#define P2DC1CON                      2373
#define STRC2                         2374
#define PSTR2CON_STRC                 2375
#define P2DC22                        2376
#define P2DC2CON                      2377
#define P2DC32                        2378
#define STRD2                         2379
#define PSTR2CON_STRD                 2380
#define P2DC3CON                      2381
#define P2DC4CON                      2382
#define STRSYNC2                      2383
#define PSTR2CON_STRSYNC              2384
#define P2DC42                        2385
#define P2DC6CON                      2386
#define PSTR2CON_CMPL                 2387
#define CMPL02                        2388
#define P2DC62                        2389
#define PSTR2CON_CMPL0                2390
#define CMPL12                        2391
#define PSTR2CON_CMPL1                2392
#define TXREG2                        2393
#define RCREG2                        2394
#define SPBRG2                        2395
#define SPBRG2_BRG0                   2396
#define SPBRG2_BRG1                   2397
#define SPBRG2_BRG2                   2398
#define SPBRG2_BRG3                   2399
#define SPBRG2_BRG4                   2400
#define SPBRG2_BRG5                   2401
#define SPBRG2_BRG6                   2402
#define SPBRG2_BRG7                   2403
#define SPBRGH2                       2404
#define SPBRGH2_BRG8                  2405
#define SPBRGH2_BRG9                  2406
#define SPBRGH2_BRG10                 2407
#define SPBRGH2_BRG11                 2408
#define SPBRGH2_BRG12                 2409
#define SPBRGH2_BRG13                 2410
#define SPBRGH2_BRG14                 2411
#define SPBRGH2_BRG15                 2412
#define DSGPR3                        2413
#define DSGPR2                        2414
#define DSGPR1                        2415
#define DSGPR0                        2416
#define DSWAKEH                       2417
#define DSINT0                        2418
#define DSWAKEL                       2419
#define DSPOR                         2420
#define DSICD                         2421
#define DSMCLR                        2422
#define DSRTC                         2423
#define DSWDT                         2424
#define DSULP                         2425
#define DSWAKEL_BOR                   2426
#define DSFLT                         2427
#define DSCONH                        2428
#define RTCWDIS                       2429
#define DSEN                          2430
#define DSCONL                        2431
#define RELEASE                       2432
#define DSBOR                         2433
#define ULPWDIS                       2434
#define TXREG3                        2435
#define RCREG3                        2436
#define SPBRG3                        2437
#define SPBRG3_BRG0                   2438
#define SPBRG3_BRG1                   2439
#define SPBRG3_BRG2                   2440
#define SPBRG3_BRG3                   2441
#define SPBRG3_BRG4                   2442
#define SPBRG3_BRG5                   2443
#define SPBRG3_BRG6                   2444
#define SPBRG3_BRG7                   2445
#define SPBRGH3                       2446
#define SPBRGH3_BRG8                  2447
#define SPBRGH3_BRG9                  2448
#define SPBRGH3_BRG10                 2449
#define SPBRGH3_BRG11                 2450
#define SPBRGH3_BRG12                 2451
#define SPBRGH3_BRG13                 2452
#define SPBRGH3_BRG14                 2453
#define SPBRGH3_BRG15                 2454
#define BAUDCON3                      2455
#define BAUDCON3_ABDEN                2456
#define BAUDCON3_WUE                  2457
#define BAUDCON3_IREN                 2458
#define BAUDCON3_BRG16                2459
#define BAUDCON3_TXCKP                2460
#define BAUDCON3_RXDTP                2461
#define BAUDCON3_RCIDL                2462
#define BAUDCON3_ABDOVF               2463
#define TXSTA3                        2464
#define TXSTA3_TX9D                   2465
#define TXSTA3_TRMT                   2466
#define TXSTA3_BRGH                   2467
#define TXSTA3_SENDB                  2468
#define TXSTA3_SYNC                   2469
#define TXSTA3_TXEN                   2470
#define TXSTA3_TX9                    2471
#define TXSTA3_CSRC                   2472
#define RCSTA3                        2473
#define RCSTA3_RX9D                   2474
#define RCSTA3_OERR                   2475
#define RCSTA3_FERR                   2476
#define RCSTA3_ADDEN                  2477
#define RCSTA3_CREN                   2478
#define RCSTA3_SREN                   2479
#define RCSTA3_RX9                    2480
#define RCSTA3_SPEN                   2481
#define SPBRGH1_BRG8                  2482
#define SPBRGH1                       2483
#define SPBRGH1_BRG9                  2484
#define SPBRGH1_BRG10                 2485
#define SPBRGH1_BRG11                 2486
#define SPBRGH1_BRG12                 2487
#define SPBRGH1_BRG13                 2488
#define SPBRGH1_BRG14                 2489
#define SPBRGH1_BRG15                 2490
#define BAUDCON2                      2491
#define ABDEN2                        2492
#define BAUDCON2_ABDEN                2493
#define WUE2                          2494
#define BAUDCON2_WUE                  2495
#define BAUDCON2_IREN                 2496
#define BRG162                        2497
#define BAUDCON2_BRG16                2498
#define SCKP2                         2499
#define TXCKP2                        2500
#define BAUDCON2_TXCKP                2501
#define DTRXP2                        2502
#define RXDTP2                        2503
#define BAUDCON2_RXDTP                2504
#define RCMT2                         2505
#define RCIDL2                        2506
#define BAUDCON2_RCIDL                2507
#define BAUDCON2_ABDOVF               2508
#define ABDOVF2                       2509
#define TXSTA2                        2510
#define TXSTA2_TX9D                   2511
#define TXD82                         2512
#define TXSTA2_TRMT                   2513
#define TXSTA2_BRGH                   2514
#define TXSTA2_SENDB                  2515
#define TXSTA2_SYNC                   2516
#define TXSTA2_TXEN                   2517
#define TX8_92                        2518
#define TXSTA2_TX9                    2519
#define TXSTA2_CSRC                   2520
#define RCSTA2                        2521
#define RCD82                         2522
#define RCSTA2_RX9D                   2523
#define RCSTA2_OERR                   2524
#define RCSTA2_FERR                   2525
#define RCSTA2_ADDEN                  2526
#define RCSTA2_CREN                   2527
#define RCSTA2_SREN                   2528
#define RC92                          2529
#define RC8_92                        2530
#define RCSTA2_RX9                    2531
#define RCSTA2_SPEN                   2532
#define CCPTMRS2                      2533
#define C8TSEL0                       2534
#define C8TSEL                        2535
#define C8TSEL1                       2536
#define C9TSEL                        2537
#define C9TSEL0                       2538
#define C10TSEL0                      2539
#define C10TSEL                       2540
#define CCPTMRS1                      2541
#define C4TSEL                        2542
#define C4TSEL0                       2543
#define C4TSEL1                       2544
#define C5TSEL                        2545
#define C5TSEL0                       2546
#define C6TSEL0                       2547
#define C6TSEL                        2548
#define C7TSEL                        2549
#define C7TSEL0                       2550
#define C7TSEL1                       2551
#define CCPTMRS0                      2552
#define C1TSEL0                       2553
#define C1TSEL                        2554
#define C1TSEL1                       2555
#define C1TSEL2                       2556
#define C2TSEL0                       2557
#define C2TSEL                        2558
#define C2TSEL1                       2559
#define C2TSEL2                       2560
#define C3TSEL0                       2561
#define C3TSEL                        2562
#define C3TSEL1                       2563
#define CM3CON                        2564
#define CM3CON_CCH                    2565
#define CCH03                         2566
#define CM3CON_CCH0                   2567
#define CCH13                         2568
#define CM3CON_CCH1                   2569
#define CM3CON_CREF                   2570
#define CREF3                         2571
#define CM3CON_EVPOL                  2572
#define EVPOL03                       2573
#define CM3CON_EVPOL0                 2574
#define CM3CON_EVPOL1                 2575
#define EVPOL13                       2576
#define CM3CON_CPOL                   2577
#define CPOL3                         2578
#define COE3                          2579
#define CM3CON_COE                    2580
#define CM3CON_CON                    2581
#define CON3                          2582
#define CM2CON                        2583
#define CM2CON_CCH                    2584
#define CM2CON_CCH0                   2585
#define CCH02                         2586
#define CCH12                         2587
#define CM2CON_CCH1                   2588
#define CM2CON_CREF                   2589
#define CREF2                         2590
#define CM2CON_EVPOL                  2591
#define EVPOL02                       2592
#define CM2CON_EVPOL0                 2593
#define EVPOL12                       2594
#define CM2CON_EVPOL1                 2595
#define CM2CON_CPOL                   2596
#define CPOL2                         2597
#define CM2CON_COE                    2598
#define COE2                          2599
#define CM2CON_CON                    2600
#define CON2                          2601
#define SSP2CON3                      2602
#define SSP2CON3_DHEN                 2603
#define SSP2CON3_AHEN                 2604
#define SSP2CON3_SBCDE                2605
#define SSP2CON3_SDAHT                2606
#define SSP2CON3_BOEN                 2607
#define SSP2CON3_SCIE                 2608
#define SSP2CON3_PCIE                 2609
#define SSP2CON3_ACKTIM               2610
#define T8CON                         2611
#define T8CKPS0                       2612
#define T8CKPS                        2613
#define T8CKPS1                       2614
#define TMR8ON                        2615
#define T8OUTPS                       2616
#define T8OUTPS0                      2617
#define T8OUTPS1                      2618
#define T8OUTPS2                      2619
#define T8OUTPS3                      2620
#define PR8                           2621
#define TMR8                          2622
#define T6CON                         2623
#define T6CKPS0                       2624
#define T6CKPS                        2625
#define T6CKPS1                       2626
#define TMR6ON                        2627
#define T6OUTPS0                      2628
#define T6OUTPS                       2629
#define T6OUTPS1                      2630
#define T6OUTPS2                      2631
#define T6OUTPS3                      2632
#define PR6                           2633
#define TMR6                          2634
#define CCP10CON                      2635
#define CCP10M                        2636
#define CCP10M0                       2637
#define CCP10M1                       2638
#define CCP10M2                       2639
#define CCP10M3                       2640
#define CCP10Y                        2641
#define DC10B0                        2642
#define DC10B                         2643
#define CCP10X                        2644
#define DC10B1                        2645
#define CCPR10L                       2646
#define CCPR10H                       2647
#define CCP9CON                       2648
#define CCP9M0                        2649
#define CCP9M                         2650
#define CCP9M1                        2651
#define CCP9M2                        2652
#define CCP9M3                        2653
#define CCP9Y                         2654
#define DC9B0                         2655
#define DC9B                          2656
#define CCP9X                         2657
#define DC9B1                         2658
#define CCPR9L                        2659
#define CCPR9H                        2660
#define CCP8CON                       2661
#define CCP8M0                        2662
#define CCP8M                         2663
#define CCP8M1                        2664
#define CCP8M2                        2665
#define CCP8M3                        2666
#define DC8B0                         2667
#define CCP8Y                         2668
#define DC8B                          2669
#define DC8B1                         2670
#define CCP8X                         2671
#define CCPR8L                        2672
#define CCPR8H                        2673
#define CCP3CON                       2674
#define CCP3M                         2675
#define CCP3M0                        2676
#define CCP3M1                        2677
#define CCP3M2                        2678
#define CCP3M3                        2679
#define CCP3Y                         2680
#define DC3B                          2681
#define DC3B0                         2682
#define DC3B1                         2683
#define CCP3X                         2684
#define P3M                           2685
#define P3M0                          2686
#define P3M1                          2687
#define CCPR3L                        2688
#define CCPR3H                        2689
#define ECCP3DEL                      2690
#define P3DC                          2691
#define P3DC0                         2692
#define P3DC1                         2693
#define P3DC2                         2694
#define P3DC3                         2695
#define P3DC4                         2696
#define P3DC5                         2697
#define P3DC6                         2698
#define P3RSEN                        2699
#define PSS3BD0                       2700
#define PSS3BD                        2701
#define PSS3BD1                       2702
#define PSS3AC0                       2703
#define PSS3AC                        2704
#define PSS3AC1                       2705
#define ECCP3AS                       2706
#define ECCP3AS0                      2707
#define ECCP3AS1                      2708
#define ECCP3AS2                      2709
#define ECCP3ASE                      2710
#define CCP2CON                       2711
#define CCP2M                         2712
#define CCP2M0                        2713
#define CCP2M1                        2714
#define CCP2M2                        2715
#define CCP2M3                        2716
#define DC2B                          2717
#define DC2B0                         2718
#define CCP2Y                         2719
#define DC2B1                         2720
#define CCP2X                         2721
#define P2M                           2722
#define P2M0                          2723
#define P2M1                          2724
#define CCPR2L                        2725
#define CCPR2H                        2726
#define ECCP2DEL                      2727
#define P2DC                          2728
#define P2DC0                         2729
#define P2DC1                         2730
#define P2DC2                         2731
#define P2DC3                         2732
#define P2DC4                         2733
#define P2DC5                         2734
#define P2DC6                         2735
#define P2RSEN                        2736
#define PSS2BD                        2737
#define PSS2BD0                       2738
#define PSS2BD1                       2739
#define PSS2AC0                       2740
#define PSS2AC                        2741
#define PSS2AC1                       2742
#define ECCP2AS0                      2743
#define ECCP2AS                       2744
#define ECCP2AS1                      2745
#define ECCP2AS2                      2746
#define ECCP2ASE                      2747
#define CM1CON                        2748
#define CM1CON_CCH                    2749
#define C1CH0                         2750
#define CM1CON_CCH0                   2751
#define CCH01                         2752
#define CCH11                         2753
#define C1CH1                         2754
#define CM1CON_CCH1                   2755
#define CM1CON_CREF                   2756
#define CREF1                         2757
#define EVPOL01                       2758
#define CM1CON_EVPOL0                 2759
#define CM1CON_EVPOL                  2760
#define CM1CON_EVPOL1                 2761
#define EVPOL11                       2762
#define CM1CON_CPOL                   2763
#define CPOL1                         2764
