tiborsimon/embedded-tdd-headers/pic/8bit/pic18f95j94_tdd.h
#define LATF7                         3323
#define LATG                          3324
#define LATG0                         3325
#define LG0                           3326
#define LATG1                         3327
#define LG1                           3328
#define LATG2                         3329
#define LG2                           3330
#define LATG3                         3331
#define LG3                           3332
#define LATG4                         3333
#define LG4                           3334
#define LATG6                         3335
#define LATG7                         3336
#define LATH                          3337
#define LH0                           3338
#define LATH0                         3339
#define LH1                           3340
#define LATH1                         3341
#define LH2                           3342
#define LATH2                         3343
#define LH3                           3344
#define LATH3                         3345
#define LH4                           3346
#define LATH4                         3347
#define LH5                           3348
#define LATH5                         3349
#define LH6                           3350
#define LATH6                         3351
#define LH7                           3352
#define LATH7                         3353
#define LATJ                          3354
#define LATJ0                         3355
#define LJ0                           3356
#define LATJ1                         3357
#define LJ1                           3358
#define LATJ2                         3359
#define LJ2                           3360
#define LATJ3                         3361
#define LJ3                           3362
#define LATJ4                         3363
#define LJ4                           3364
#define LATJ5                         3365
#define LJ5                           3366
#define LATJ6                         3367
#define LJ6                           3368
#define LATJ7                         3369
#define LJ7                           3370
#define TRISA                         3371
#define TRISA0                        3372
#define TRISA1                        3373
#define TRISA2                        3374
#define TRISA3                        3375
#define TRISA4                        3376
#define TRISA5                        3377
#define TRISA6                        3378
#define TRISA7                        3379
#define TRISB                         3380
#define TRISB0                        3381
#define TRISB1                        3382
#define TRISB2                        3383
#define TRISB3                        3384
#define TRISB4                        3385
#define TRISB5                        3386
#define TRISB6                        3387
#define TRISB7                        3388
#define TRISC                         3389
#define TRISC0                        3390
#define TRISC1                        3391
#define TRISC2                        3392
#define TRISC3                        3393
#define TRISC4                        3394
#define TRISC5                        3395
#define TRISC6                        3396
#define TRISC7                        3397
#define TRISD                         3398
#define TRISD0                        3399
#define TRISD1                        3400
#define TRISD2                        3401
#define TRISD3                        3402
#define TRISD4                        3403
#define TRISD5                        3404
#define TRISD6                        3405
#define TRISD7                        3406
#define TRISE                         3407
#define TRISE0                        3408
#define TRISE1                        3409
#define TRISE2                        3410
#define TRISE3                        3411
#define TRISE4                        3412
#define TRISE5                        3413
#define TRISE6                        3414
#define TRISE7                        3415
#define TRISF                         3416
#define TRISF2                        3417
#define TRISF3                        3418
#define TRISF4                        3419
#define TRISF5                        3420
#define TRISF6                        3421
#define TRISF7                        3422
#define TRISG                         3423
#define TRISG0                        3424
#define TRISG1                        3425
#define TRISG2                        3426
#define TRISG3                        3427
#define TRISG4                        3428
#define TRISG6                        3429
#define TRISG7                        3430
#define TRISH                         3431
#define TRISH0                        3432
#define TRISH1                        3433
#define TRISH2                        3434
#define TRISH3                        3435
#define TRISH4                        3436
#define TRISH5                        3437
#define TRISH6                        3438
#define TRISH7                        3439
#define TRISJ                         3440
#define TRISJ0                        3441
#define TRISJ1                        3442
#define TRISJ2                        3443
#define TRISJ3                        3444
#define TRISJ4                        3445
#define TRISJ5                        3446
#define TRISJ6                        3447
#define TRISJ7                        3448
#define OSCTUNE                       3449
#define TUN0                          3450
#define TUN                           3451
#define TUN1                          3452
#define TUN2                          3453
#define TUN3                          3454
#define TUN4                          3455
#define TUN5                          3456
#define PSTR1CON                      3457
#define PSTR1CON_STRA                 3458
#define PSTR1CON_STRB                 3459
#define PSTR1CON_STRC                 3460
#define PSTR1CON_STRD                 3461
#define PSTR1CON_STRSYNC              3462
#define PSTR1CON_CMPL0                3463
#define PSTR1CON_CMPL                 3464
#define PSTR1CON_CMPL1                3465
#define PIE1                          3466
#define TMR1IE                        3467
#define TMR2IE                        3468
#define TMR1GIE                       3469
#define SSP1IE                        3470
#define TXIE                          3471
#define TX1IE                         3472
#define RC1IE                         3473
#define ADIE                          3474
#define PSPIE                         3475
#define PIR1                          3476
#define TMR1IF                        3477
#define TMR2IF                        3478
#define TMR1GIF                       3479
#define SSP1IF                        3480
#define TXIF                          3481
#define TX1IF                         3482
#define RC1IF                         3483
#define ADIF                          3484
#define PSPIF                         3485
#define IPR1                          3486
#define TMR1IP                        3487
#define TMR2IP                        3488
#define TMR1GIP                       3489
#define SSP1IP                        3490
#define TX1IP                         3491
#define RC1IP                         3492
#define ADIP                          3493
#define PSPIP                         3494
#define PIE2                          3495
#define TMR3GIE                       3496
#define TMR3IE                        3497
#define HLVDIE                        3498
#define BCL1IE                        3499
#define USBIE                         3500
#define BCL2IE                        3501
#define SSP2IE                        3502
#define CMIE                          3503
#define OSCFIE                        3504
#define PIR2                          3505
#define TMR3GIF                       3506
#define TMR3IF                        3507
#define HLVDIF                        3508
#define LVDIF                         3509
#define BCL1IF                        3510
#define USBIF                         3511
#define BCL2IF                        3512
#define CMIF                          3513
#define SSP2IF                        3514
#define OSCFIF                        3515
#define IPR2                          3516
#define TMR3GIP                       3517
#define TMR3IP                        3518
#define HLVDIP                        3519
#define BCL1IP                        3520
#define USBIP                         3521
#define BCL2IP                        3522
#define CMIP                          3523
#define SSP2IP                        3524
#define OSCFIP                        3525
#define PIE3                          3526
#define RXB0IE                        3527
#define RTCCIE                        3528
#define RXBNIE                        3529
#define CCP1IE                        3530
#define RXB1IE                        3531
#define CCP2IE                        3532
#define TXB0IE                        3533
#define CTMUIE                        3534
#define TXB1IE                        3535
#define TXBNIE                        3536
#define TXB2IE                        3537
#define TX2IE                         3538
#define RC2IE                         3539
#define LCDIE                         3540
#define TMR5GIE                       3541
#define PIR3                          3542
#define RTCCIF                        3543
#define RXBNIF                        3544
#define CCP1IF                        3545
#define CCP2IF                        3546
#define CTMUIF                        3547
#define TXBNIF                        3548
#define TX2IF                         3549
#define RC2IF                         3550
#define LCDIF                         3551
#define TMR5GIF                       3552
#define IPR3                          3553
#define RTCCIP                        3554
#define CCP1IP                        3555
#define RXBNIP                        3556
#define CCP2IP                        3557
#define CTMUIP                        3558
#define TX2IP                         3559
#define TXBNIP                        3560
#define RC2IP                         3561
#define LCDIP                         3562
#define TMR5GIP                       3563
#define PIR6                          3564
#define CMP1IF                        3565
#define CMP2IF                        3566
#define CMP3IF                        3567
#define TX3IF                         3568
#define RC3IF                         3569
#define TX4IF                         3570
#define RC4IF                         3571
#define PSPCON                        3572
#define PSPMODE                       3573
#define IBOV                          3574
#define OBF                           3575
#define IBF                           3576
#define HLVDCON                       3577
#define HLVDL                         3578
#define HLVDL0                        3579
#define HLVDL1                        3580
#define HLVDL2                        3581
#define HLVDL3                        3582
#define HLVDEN                        3583
#define IRVST                         3584
#define BGVST                         3585
#define VDIRMAG                       3586
#define IPR6                          3587
#define CMP1IP                        3588
#define CMP2IP                        3589
#define CMP3IP                        3590
#define TX3IP                         3591
#define RC3IP                         3592
#define TX4IP                         3593
#define RC4IP                         3594
#define T1GCON                        3595
#define T1GSS0                        3596
#define T1GSS                         3597
#define T1GSS1                        3598
#define T1GVAL                        3599
#define T1GGO_nT1DONE                 3600
#define nT1DONE                       3601
#define T1GGO_NOT_T1DONE              3602
#define NOT_T1DONE                    3603
#define T1GGO                         3604
#define T1GSPM                        3605
#define T1GTM                         3606
#define T1GPOL                        3607
#define TMR1GE                        3608
#define RCSTA1                        3609
#define RCD8                          3610
#define RCSTA1_RX9D                   3611
#define RCSTA1_OERR                   3612
#define RCSTA1_FERR                   3613
#define RCSTA1_ADDEN                  3614
#define ADEN                          3615
#define RCSTA1_CREN                   3616
#define RCSTA1_SREN                   3617
#define SRENA                         3618
#define RC8_9                         3619
#define RC9                           3620
#define RCSTA1_RX9                    3621
#define RCSTA1_SPEN                   3622
#define TXSTA1                        3623
#define TX9D1                         3624
#define TXSTA1_TX9D                   3625
#define TXD8                          3626
#define TRMT1                         3627
#define TXSTA1_TRMT                   3628
#define BRGH1                         3629
#define TXSTA1_BRGH                   3630
#define TXSTA1_SENDB                  3631
#define SENDB1                        3632
#define TXSTA1_SYNC                   3633
#define SYNC1                         3634
#define TXEN1                         3635
#define TXSTA1_TXEN                   3636
#define TX91                          3637
#define TX8_9                         3638
#define TXSTA1_TX9                    3639
#define TXSTA1_CSRC                   3640
#define CSRC1                         3641
#define TXREG1                        3642
#define RCREG1                        3643
#define SPBRG1_BRG0                   3644
#define SPBRG1                        3645
#define SPBRG1_BRG1                   3646
#define SPBRG1_BRG2                   3647
#define SPBRG1_BRG3                   3648
#define SPBRG1_BRG4                   3649
#define SPBRG1_BRG5                   3650
#define SPBRG1_BRG6                   3651
#define SPBRG1_BRG7                   3652
#define T3GCON                        3653
#define T3GSS0                        3654
#define T3GSS                         3655
#define T3GSS1                        3656
#define T3GVAL                        3657
#define T3GGO                         3658
#define NOT_T3DONE                    3659
#define nT3DONE                       3660
#define T3GGO_nT3DONE                 3661
#define T3GGO_NOT_T3DONE              3662
#define T3GSPM                        3663
#define T3GTM                         3664
#define T3GPOL                        3665
#define TMR3GE                        3666
#define T3CON                         3667
#define TMR3ON                        3668
#define T3CON_RD16                    3669
#define nT3SYNC                       3670
#define NOT_T3SYNC                    3671
#define SOSCEN3                       3672
#define T3CON_SOSCEN                  3673
#define T3CKPS0                       3674
#define T3CON_TCKPS                   3675
#define T3CKPS1                       3676
#define TMR3CS0                       3677
#define TMR3CS                        3678
#define TMR3CS1                       3679
#define T3RD16                        3680
#define RD163                         3681
#define TMR3L                         3682
#define TMR3H                         3683
#define PIE4                          3684
#define ECCP3IE                       3685
#define CCP4IE                        3686
#define CCP5IE                        3687
#define CCP6IE                        3688
#define CCP7IE                        3689
#define CCP8IE                        3690
#define CCP9IE                        3691
#define CCP10IE                       3692
#define PIR4                          3693
#define ECCP3IF                       3694
#define CCP4IF                        3695
#define CCP5IF                        3696
#define CCP6IF                        3697
#define CCP7IF                        3698
#define CCP8IF                        3699
#define CCP9IF                        3700
#define CCP10IF                       3701
#define IPR4                          3702
#define ECCP3IP                       3703
#define CCIP3IP                       3704
#define CCP4IP                        3705
#define CCP5IP                        3706
#define CCP6IP                        3707
#define CCP7IP                        3708
#define CCP8IP                        3709
#define CCP9IP                        3710
#define CCP10IP                       3711
#define PIE5                          3712
#define TMR4IE                        3713
#define TMR5IE                        3714
#define TMR6IE                        3715
#define TMR8IE                        3716
#define ACTLOCKIE                     3717
#define ACTORSIE                      3718
#define PIR5                          3719
#define TMR4IF                        3720
#define TMR5IF                        3721
#define TMR6IF                        3722
#define TMR8IF                        3723
#define ACTLOCKIF                     3724
#define ACTORSIF                      3725
#define CCP1CON                       3726
#define CCP1M0                        3727
#define CCP1M                         3728
#define CCP1M1                        3729
#define CCP1M2                        3730
#define CCP1M3                        3731
#define CCP1Y                         3732
#define DC1B                          3733
#define DC1B0                         3734
#define CCP1X                         3735
#define DC1B1                         3736
#define P1M                           3737
#define P1M0                          3738
#define P1M1                          3739
#define CCPR1L                        3740
#define CCPR1H                        3741
#define ECCP1DEL                      3742
#define P1DC                          3743
#define P1DC0                         3744
#define P1DC1                         3745
#define P1DC2                         3746
#define P1DC3                         3747
#define P1DC4                         3748
#define P1DC5                         3749
#define P1DC6                         3750
#define P1RSEN                        3751
#define PSS1BD0                       3752
#define PSS1BD                        3753
#define PSS1BD1                       3754
#define PSS1AC                        3755
#define PSS1AC0                       3756
#define PSS1AC1                       3757
#define ECCP1AS                       3758
#define ECCP1AS0                      3759
#define ECCP1AS1                      3760
#define ECCP1AS2                      3761
#define ECCP1ASE                      3762
#define CVRCONL                       3763
#define CVRNSS                        3764
#define CVRPSS0                       3765
#define CVRPSS                        3766
#define CVRPSS1                       3767
#define CVROE                         3768
#define CVREN                         3769
#define CVRCONH                       3770
#define CVR                           3771
#define CVR0                          3772
#define CVR1                          3773
#define CVR2                          3774
#define CVR3                          3775
#define CVR4                          3776
#define ADCON1L                       3777
#define DONE                          3778
#define SAMP                          3779
#define ASAM                          3780
#define SSRC0                         3781
#define SSRC                          3782
#define SSRC1                         3783
#define SSRC2                         3784
#define SSRC3                         3785
#define ADCON1H                       3786
#define FORM0                         3787
#define FORM                          3788
#define FORM1                         3789
#define MODE12                        3790
#define ADON                          3791
#define ADCBUF0L                      3792
#define ADCBUF0H                      3793
#define CMSTAT                        3794
#define C1OUT                         3795
#define C2OUT                         3796
#define C3OUT                         3797
#define SSP1CON2                      3798
#define SEN1                          3799
#define SSP1CON2_SEN                  3800
#define ADMSK11                       3801
#define SSP1CON2_RSEN                 3802
#define RSEN1                         3803
#define SSP1CON2_ADMSK1               3804
#define SSP1CON2_ADMSK                3805
#define SSP1CON2_PEN                  3806
#define ADMSK21                       3807
#define PEN1                          3808
#define SSP1CON2_ADMSK2               3809
#define ADMSK31                       3810
#define RCEN1                         3811
#define SSP1CON2_RCEN                 3812
#define SSP1CON2_ADMSK3               3813
#define SSP1CON2_ACKEN                3814
#define ACKEN1                        3815
#define ADMSK41                       3816
#define SSP1CON2_ADMSK4               3817
#define ACKDT1                        3818
#define ADMSK51                       3819
#define SSP1CON2_ACKDT                3820
#define SSP1CON2_ADMSK5               3821
#define SSP1CON2_ACKSTAT              3822
#define ACKSTAT1                      3823
#define GCEN1                         3824
#define SSP1CON2_GCEN                 3825
#define SSP1CON1                      3826
#define SSP1CON1_SSPM0                3827
#define SSPM01                        3828
#define SSP1CON1_SSPM                 3829
#define SSP1CON1_SSPM1                3830
#define SSPM11                        3831
#define SSP1CON1_SSPM2                3832
#define SSPM21                        3833
#define SSPM31                        3834
#define SSP1CON1_SSPM3                3835
#define SSP1CON1_CKP                  3836
#define CKP1                          3837
#define SSPEN1                        3838
#define SSP1CON1_SSPEN                3839
#define SSPOV1                        3840
#define SSP1CON1_SSPOV                3841
#define WCOL1                         3842
#define SSP1CON1_WCOL                 3843
#define SSP1STAT                      3844
#define BF1                           3845
#define SSP1STAT_BF                   3846
#define UA1                           3847
#define SSP1STAT_UA                   3848
#define SSP1STAT_R_NOT_W              3849
#define RW1                           3850
#define SSP1STAT_nW                   3851
#define RW                            3852
#define SSP1STAT_READ_WRITE           3853
#define SSP1STAT_nWRITE               3854
#define SSP1STAT_I2C_READ             3855
#define SSP1STAT_R_W                  3856
#define R                             3857
#define SSP1STAT_NOT_WRITE            3858
#define SSP1STAT_R_nW                 3859
#define SSP1STAT_S                    3860
#define START                         3861
#define START1                        3862
#define SSP1STAT_I2C_START            3863
#define STOP                          3864
#define SSP1STAT_P                    3865
#define STOP1                         3866
#define SSP1STAT_I2C_STOP             3867
#define SSP1STAT_D_NOT_A              3868
#define SSP1STAT_D_A                  3869
#define SSP1STAT_D_nA                 3870
#define SSP1STAT_NOT_ADDRESS          3871
#define SSP1STAT_DATA_ADDRESS         3872
#define SSP1STAT_nA                   3873
#define D                             3874
#define DA1                           3875
#define DA                            3876
#define SSP1STAT_nADDRESS             3877
#define SSP1STAT_I2C_DAT              3878
#define SSP1STAT_CKE                  3879
#define CKE1                          3880
